{"class_name": "Functional", "config": {"name": "model", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "string", "sparse": false, "ragged": false, "name": "gender"}, "name": "gender", "inbound_nodes": []}, {"class_name": "StringLookup", "config": {"name": "string_lookup", "trainable": true, "batch_input_shape": [null, null], "dtype": "string", "invert": false, "max_tokens": null, "num_oov_indices": 1, "oov_token": "[UNK]", "mask_token": "", "encoding": "utf-8"}, "name": "string_lookup", "inbound_nodes": [[["gender", 0, 0, {}]]]}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "age"}, "name": "age", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "mean_lhv"}, "name": "mean_lhv", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "mean_rhv"}, "name": "mean_rhv", "inbound_nodes": []}, {"class_name": "CategoryEncoding", "config": {"name": "category_encoding", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "max_tokens": 4, "output_mode": "binary", "sparse": false}, "name": "category_encoding", "inbound_nodes": [[["string_lookup", 0, 0, {}]]]}, {"class_name": "Normalization", "config": {"name": "normalization", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "axis": [-1]}, "name": "normalization", "inbound_nodes": [[["age", 0, 0, {}]]]}, {"class_name": "Normalization", "config": {"name": "normalization_1", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "axis": [-1]}, "name": "normalization_1", "inbound_nodes": [[["mean_lhv", 0, 0, {}]]]}, {"class_name": "Normalization", "config": {"name": "normalization_2", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "axis": [-1]}, "name": "normalization_2", "inbound_nodes": [[["mean_rhv", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate", "trainable": true, "dtype": "float32", "axis": -1}, "name": "concatenate", "inbound_nodes": [[["category_encoding", 0, 0, {}], ["normalization", 0, 0, {}], ["normalization_1", 0, 0, {}], ["normalization_2", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense", "trainable": true, "dtype": "float32", "units": 32, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense", "inbound_nodes": [[["concatenate", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout", "trainable": true, "dtype": "float32", "rate": 0.5, "noise_shape": null, "seed": null}, "name": "dropout", "inbound_nodes": [[["dense", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "dtype": "float32", "units": 1, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_1", "inbound_nodes": [[["dropout", 0, 0, {}]]]}], "input_layers": [["gender", 0, 0], ["age", 0, 0], ["mean_lhv", 0, 0], ["mean_rhv", 0, 0]], "output_layers": [["dense_1", 0, 0]]}, "keras_version": "2.4.0", "backend": "tensorflow"}